In [1]:
import pandas as pd

## Чтение и исследование данных

In [3]:
df = pd.read_csv('tasks/train.csv')

In [17]:
df.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [5]:
df.size

130632

In [6]:
df.shape

(10886, 12)

In [7]:
df.describe()

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
count,10886.000000,10886.000000,10886.000000,10886.000000,10886.00000,10886.000000,10886.000000,10886.000000,10886.000000,10886.000000,10886.000000
mean,2.506614,0.028569,0.680875,1.418427,20.23086,23.655084,61.886460,12.799395,36.021955,155.552177,191.574132
std,1.116174,0.166599,0.466159,0.633839,7.79159,8.474601,19.245033,8.164537,49.960477,151.039033,181.144454
min,1.000000,0.000000,0.000000,1.000000,0.82000,0.760000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,0.000000,1.000000,13.94000,16.665000,47.000000,7.001500,4.000000,36.000000,42.000000
50%,3.000000,0.000000,1.000000,1.000000,20.50000,24.240000,62.000000,12.998000,17.000000,118.000000,145.000000
75%,4.000000,0.000000,1.000000,2.000000,26.24000,31.060000,77.000000,16.997900,49.000000,222.000000,284.000000
max,4.000000,1.000000,1.000000,4.000000,41.00000,45.455000,100.000000,56.996900,367.000000,886.000000,977.000000

In [10]:
df.isna().sum() # проверка на пустые значения

datetime      0
season        0
holiday       0
workingday    0
weather       0
temp          0
atemp         0
humidity      0
windspeed     0
casual        0
registered    0
count         0
dtype: int64

In [11]:
df.columns # имена колонок

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

In [14]:
df.dtypes # типы данных

datetime       object
season          int64
holiday         int64
workingday      int64
weather         int64
temp          float64
atemp         float64
humidity        int64
windspeed     float64
casual          int64
registered      int64
count           int64
dtype: object

In [15]:
df.datetime = pd.to_datetime(df.datetime) # дата к формату dt

In [33]:
df.dtypes # типы данных колонок

datetime      datetime64[ns]
season                 int64
holiday                int64
workingday             int64
weather                int64
temp                 float64
atemp                float64
humidity               int64
windspeed            float64
casual                 int64
registered             int64
count                  int64
dtype: object

In [30]:
df.nunique() # количество уникальных значений

datetime      10886
season            4
holiday           2
workingday        2
weather           4
temp             49
atemp            60
humidity         89
windspeed        28
casual          309
registered      731
count           822
dtype: int64

In [32]:
df.season.value_counts() # количество значений

season
4    2734
2    2733
3    2733
1    2686
Name: count, dtype: int64

## Фильтрация данных

In [26]:
df[(df.workingday == 0) & (df.holiday == 1)].head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
372,2011-01-17 00:00:00,1,1,0,2,8.20,9.850,47,15.0013,1,16,17
373,2011-01-17 01:00:00,1,1,0,2,8.20,9.850,44,12.9980,1,15,16
374,2011-01-17 02:00:00,1,1,0,2,7.38,8.335,43,16.9979,0,8,8
375,2011-01-17 03:00:00,1,1,0,2,7.38,9.090,43,12.9980,0,2,2
376,2011-01-17 04:00:00,1,1,0,2,7.38,9.850,43,8.9981,1,2,3

In [38]:
df[~((df.workingday == 0) & (df.holiday == 1))].head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [41]:
df[df.windspeed.isna()]

Empty DataFrame
Columns: [datetime, season, holiday, workingday, weather, temp, atemp, humidity, windspeed, casual, registered, count]
Index: []

In [45]:
# check NaN
df.windspeed.isna().any() 
df.isna().any().any()

False

In [49]:
df[df.season.isin([4, 3])].head() # column values in some list

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
2690,2011-07-01 00:00:00,3,0,1,1,27.06,31.060,50,0.0,20,48,68
2691,2011-07-01 01:00:00,3,0,1,1,27.06,31.060,50,0.0,15,16,31
2692,2011-07-01 02:00:00,3,0,1,1,25.42,30.305,69,0.0,6,7,13
2693,2011-07-01 03:00:00,3,0,1,1,26.24,31.060,53,0.0,5,6,11
2694,2011-07-01 04:00:00,3,0,1,1,25.42,31.060,57,0.0,1,5,6

In [51]:
df.iloc[2:4] 
# фильтрация по индексу [строки, колонки], срезы как в пайтон
# возвращает копию - нельзя использовать для присвоения значений

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13

In [54]:
df.iloc[2:4, [1,4]]

   season  weather
2       1        1
3       1        1

In [73]:
df.iloc[2,4]

1

In [58]:
df.loc[[3, 6, 8], ['season', 'humidity']] 
# фильтрация по имени [строки, колонки], можно присваивать новые значения

   season  humidity
3       1        75
6       1        80
8       1        75

In [62]:
df.loc[2]['humidity'] == df.loc[2, 'humidity']

True

In [68]:
df_2 = df.copy().set_index('datetime')

In [71]:
df_2.head()

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
datetime,,,,,,,,,,,
2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [72]:
df_2.loc['2011-01-01 00:00:00']

season         1.000
holiday        0.000
workingday     0.000
weather        1.000
temp           9.840
atemp         14.395
humidity      81.000
windspeed      0.000
casual         3.000
registered    13.000
count         16.000
Name: 2011-01-01 00:00:00, dtype: float64

In [75]:
df_2.reset_index(inplace=True) # copy if not use inplace=True

In [76]:
df_2.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

## Группировка данных

In [87]:
df.groupby('season', as_index=False).agg({'temp': 'mean'})

   season       temp
0       1  12.530491
1       2  22.823483
2       3  28.789111
3       4  16.649239

In [84]:
df.temp.mode()

0    14.76
Name: temp, dtype: float64

In [89]:
df.groupby(['season', 'workingday'], as_index=False).temp.median()

   season  workingday   temp
0       1           0  11.48
1       1           1  12.30
2       2           0  22.96
3       2           1  22.96
4       3           0  28.70
5       3           1  28.70
6       4           0  14.76
7       4           1  16.40

## Время и дата

In [95]:
df.datetime = pd.to_datetime(df.datetime)

In [96]:
df.datetime.head()

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
2   2011-01-01 02:00:00
3   2011-01-01 03:00:00
4   2011-01-01 04:00:00
Name: datetime, dtype: datetime64[ns]

In [101]:
df[df.datetime.dt.month == 5].head() # dt.month - number of a month
# df.year
# dt.day
# dt.hour

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
1778,2011-05-01 00:00:00,2,0,0,1,17.22,21.210,67,6.0032,19,77,96
1779,2011-05-01 01:00:00,2,0,0,1,17.22,21.210,69,7.0015,9,50,59
1780,2011-05-01 02:00:00,2,0,0,1,17.22,21.210,77,7.0015,7,43,50
1781,2011-05-01 03:00:00,2,0,0,1,16.40,20.455,82,7.0015,8,15,23
1782,2011-05-01 04:00:00,2,0,0,1,16.40,20.455,76,7.0015,6,11,17

In [104]:
df.datetime.dt.isocalendar().week.head() # week of the year

0    52
1    52
2    52
3    52
4    52
Name: week, dtype: UInt32

In [122]:
df.datetime.dt.isocalendar().sample(7, random_state=42)

       year  week  day
3133   2011    29    2
5786   2012     3    1
5224   2011    49    7
8953   2012    33    3
8054   2012    24    5
10044  2012    44    6
5337   2011    50    5

In [121]:
df.datetime.dt.day_name().sample(5, random_state=42)

3133      Tuesday
5786       Monday
5224       Sunday
8953    Wednesday
8054       Friday
Name: datetime, dtype: object

In [117]:
df.datetime.dt.to_period('m').head()

0    2011-01
1    2011-01
2    2011-01
3    2011-01
4    2011-01
Name: datetime, dtype: period[M]

In [127]:
df \
    .groupby(df.datetime.dt.day_name()) \
    .temp \
    .median()

datetime
Friday       19.68
Monday       21.32
Saturday     18.86
Sunday       18.86
Thursday     20.50
Tuesday      21.32
Wednesday    20.50
Name: temp, dtype: float64

## Сохранение в эксель

In [176]:
!pip install --upgrade pandas openpyxl

Requirement already satisfied: pandas in /Users/irinanechetnaya/anaconda3/lib/python3.11/site-packages (2.2.3)
Requirement already satisfied: openpyxl in /Users/irinanechetnaya/anaconda3/lib/python3.11/site-packages (3.1.5)
Requirement already satisfied: numpy>=1.23.2 in /Users/irinanechetnaya/anaconda3/lib/python3.11/site-packages (from pandas) (1.26.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/irinanechetnaya/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/irinanechetnaya/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in /Users/irinanechetnaya/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: et-xmlfile in /Users/irinanechetnaya/anaconda3/lib/python3.11/site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: six>=1.5 in /Users/irinanechetnaya/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [172]:
df.to_excel('rents.xlsx', engine='openpyxl')